{"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 72, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [8, 8], "strides": [8, 8], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [72, 64]}, "name": "reshape_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_1", "inbound_nodes": [["reshape_1", 0, 0, {"y": [[0.024274375289678574, -0.04588497802615166, -0.022755861282348633, 0.045204248279333115, 0.016912903636693954, -0.016558609902858734, -0.04054377228021622, -0.0018750056624412537, -0.03256645053625107, -0.000483047217130661, 0.03626208379864693, -0.02185814455151558, -0.028046607971191406, 0.025339413434267044, 0.0012473352253437042, 0.03646360710263252, -0.04379922151565552, 0.0015815123915672302, -0.015929579734802246, -0.0484471432864666, 0.04978847876191139, 0.022158805280923843, 0.03148834779858589, 0.03308791294693947, 0.007631421089172363, 0.01063929870724678, 0.0016340389847755432, -0.04041488096117973, 0.018326055258512497, 0.01828545704483986, 0.032635536044836044, 0.010026134550571442, -0.018546320497989655, -0.04799853637814522, -0.029627704992890358, -0.04366255924105644, 0.024443212896585464, 0.03829063102602959, 0.04456887021660805, 0.04476341977715492, 0.042156148701906204, 0.0001279488205909729, -0.014983654022216797, 0.026566218584775925, 0.035402726382017136, 0.03942194953560829, -0.0069089047610759735, -0.006269372999668121, 0.03169291093945503, 0.007387898862361908, -0.028281450271606445, -0.009550429880619049, 0.007929086685180664, 0.0033458247780799866, -0.0012164115905761719, 0.021750394254922867, -0.0016571879386901855, -0.04087267071008682, 0.019838903099298477, -0.01830495521426201, -0.021727992221713066, -0.010031092911958694, -0.015389252454042435, -0.03912168741226196], [-0.03437680006027222, -0.019790280610322952, 0.04530194774270058, -0.046865370124578476, 0.040510620921850204, 0.03263956680893898, 0.02915748581290245, -0.04082195833325386, 0.02242526039481163, -0.03865834325551987, -0.01635631173849106, 0.02135803923010826, 0.00675201416015625, -0.04273878410458565, 0.03714711591601372, -0.012517966330051422, -0.00866544246673584, 0.013419125229120255, -0.0053069107234478, -0.0030620917677879333, -0.02260725572705269, 0.010667622089385986, 0.0497448705136776, -0.04028242826461792, -0.03445710986852646, -0.03328116238117218, 0.038598839193582535, -0.0016353614628314972, -0.04999489709734917, -0.04313110187649727, 0.02426881715655327, 0.04510624334216118, -0.005999576300382614, 0.049588289111852646, -0.015505574643611908, 0.04918116703629494, 0.009183607995510101, 0.048313114792108536, -0.01291053369641304, 0.026596058160066605, -0.02508019283413887, -0.012306131422519684, 0.04691915586590767, -0.0033632293343544006, -0.045702170580625534, -0.014034401625394821, -0.04293287917971611, 0.0177849642932415, 0.01131279394030571, -0.016398966312408447, 0.03898238018155098, 0.01270851120352745, 0.035302285104990005, -0.03203117847442627, 0.027914810925722122, -0.033094823360443115, -0.004829060286283493, -0.03786196559667587, -0.03873227909207344, -0.022178376093506813, 0.03200582042336464, 0.04890913888812065, -0.034283556044101715, -0.013868428766727448], [0.0322650708258152, -0.03686264902353287, 0.02785346284508705, 0.017509829252958298, 0.03803905472159386, 0.04127885028719902, 0.011517774313688278, -0.005092669278383255, -0.00505761057138443, -0.04535127803683281, 0.006384767591953278, -0.015070296823978424, -7.478147745132446e-05, -0.0068417079746723175, -0.047524500638246536, -0.004113923758268356, -0.003938078880310059, -0.03542632982134819, 0.04871818795800209, 0.04152503237128258, -0.039868760854005814, 0.009694624692201614, 0.01134110614657402, -0.009886395186185837, 0.04253019019961357, 0.004116274416446686, 0.02319491282105446, 0.03151198849081993, 0.0001806393265724182, 0.03272754326462746, -0.04857870563864708, -0.04221860319375992, 0.01929192617535591, 0.030729476362466812, -0.016446270048618317, 0.014842811971902847, -0.045359041541814804, 0.009489130228757858, -0.004400085657835007, -0.037185512483119965, -0.012709058821201324, -0.047303080558776855, -0.02079373598098755, -0.04302610084414482, -0.003953658044338226, -0.030013371258974075, 0.04200044646859169, -0.012117244303226471, 0.010824836790561676, 0.029093991965055466, 0.007899414747953415, -0.02235335111618042, -0.03540973737835884, 0.04094986990094185, 0.045570481568574905, -0.016494952142238617, 0.04898123815655708, -0.027565062046051025, -0.03254896402359009, -0.008302021771669388, -0.010851692408323288, 0.048932600766420364, 0.0450458861887455, -0.03218268230557442], [-0.012250304222106934, 0.011290956288576126, 0.049530696123838425, 0.02098555490374565, -0.02875502221286297, 0.032536689192056656, 0.03653397783637047, -0.04562870413064957, 0.00968165323138237, 0.01857985183596611, -0.01017766073346138, 0.04436508193612099, -0.036534130573272705, 0.027607131749391556, -0.045584987848997116, -0.00027479976415634155, 0.04471473768353462, -0.0435604453086853, 0.013400021940469742, -0.03712357208132744, 0.04222897067666054, -0.04115474224090576, 0.01644757017493248, 0.020791683346033096, 0.045717742294073105, -0.03175335004925728, 0.00394061952829361, -0.032640255987644196, -0.034785471856594086, 0.04906456544995308, -0.044136714190244675, 0.039217058569192886, -0.027884675189852715, 0.0312250517308712, -0.023411333560943604, -0.005520176142454147, -0.028898214921355247, -0.024722838774323463, 0.018389727920293808, 0.031117770820856094, 0.028951216489076614, 0.027506079524755478, 0.0019481554627418518, -0.04420666769146919, -0.03286637365818024, 0.024603750556707382, -0.04483607038855553, 0.0049891844391822815, -0.04046429321169853, -0.04862863942980766, -0.012498520314693451, -0.028006328269839287, -0.011628556996583939, -0.01504436880350113, 0.011120449751615524, -0.030066048726439476, -0.032240141183137894, -0.04744694381952286, -0.0012125149369239807, 0.02451040968298912, 0.007382523268461227, 0.022405516356229782, 0.040993694216012955, -0.019750678911805153], [0.04706623777747154, -0.03901327773928642, -0.011709343641996384, -0.013501621782779694, 0.03262973949313164, -0.00358591228723526, 0.042067717760801315, 0.0018239505589008331, 0.03692389652132988, -0.039898134768009186, -0.010740257799625397, 0.0226726196706295, -0.015160717070102692, -0.0422736294567585, -0.019806241616606712, 0.045477043837308884, 0.04227513447403908, -0.007303081452846527, -0.002711176872253418, 0.0032425038516521454, 0.022034410387277603, 0.01899215206503868, 0.018641475588083267, 0.0038075074553489685, 0.038542378693819046, 0.03951779380440712, -0.03163184970617294, 0.00047472864389419556, -0.0495295524597168, -0.025848722085356712, 0.009375952184200287, -0.02374514378607273, -0.0471220389008522, -0.010568715631961823, 0.0010757558047771454, 0.04013940319418907, 0.0498356856405735, -0.04739559814333916, -0.03372187912464142, -0.0112747922539711, 0.012490592896938324, 0.0005890615284442902, 0.0009257905185222626, -0.023424530401825905, -0.004054654389619827, 0.022299278527498245, -0.027296854183077812, 0.031116772443056107, 0.03477916494011879, -0.04100118950009346, -0.048273611813783646, 0.021199312061071396, 0.0015947706997394562, -0.049562882632017136, 0.02340228483080864, -0.020546162500977516, -0.033702898770570755, -0.0173209086060524, 0.0029716864228248596, -0.0025283917784690857, 0.025800492614507675, 0.01802385225892067, -0.0039056167006492615, 0.009913455694913864], [0.033614639192819595, -0.024063123390078545, -0.04475543648004532, 0.039630357176065445, -0.04126781225204468, 0.026828277856111526, 0.013165522366762161, 0.0008213520050048828, -0.003586970269680023, 0.006215322762727737, -0.009041678160429, -0.019805002957582474, 0.0003097169101238251, -0.049883391708135605, 0.02110978588461876, -0.030906224623322487, 0.02807256206870079, -0.04289720207452774, -0.016020726412534714, 0.036594655364751816, -0.009088505059480667, -0.024289404973387718, 0.012913648039102554, -0.022577418014407158, 0.0008752234280109406, 0.03898339346051216, 0.031593237072229385, -0.03888595104217529, 0.03299689665436745, 0.01747835800051689, 0.020709898322820663, -0.001675523817539215, -0.027095401659607887, 0.03276799991726875, -0.015371430665254593, 0.0067560188472270966, -0.011278975754976273, 0.001981593668460846, -0.02561323717236519, -0.0005482658743858337, 0.011776626110076904, -0.040872953832149506, -0.016078270971775055, -0.026732278987765312, -0.0006083250045776367, 0.023562613874673843, 0.020243827253580093, 0.016510378569364548, -0.014944851398468018, 0.037259671837091446, -0.037339843809604645, 0.02279036119580269, 0.047870051115751266, 0.026841435581445694, 0.01098235696554184, 0.01770869269967079, 0.04135319963097572, -0.014164648950099945, 0.029217232018709183, -0.04781240224838257, 0.03567923232913017, -0.015250813215970993, -0.03339219093322754, 0.00688336044549942], [-0.044200349599123, 0.0018649101257324219, 0.012312114238739014, 0.018045078963041306, -0.011579465121030807, 0.014599394053220749, -0.04210244491696358, -0.04440657049417496, -0.023185838013887405, -0.004415404051542282, -0.046668101102113724, 0.04138137027621269, 0.021013323217630386, -0.04467279836535454, 0.02100810781121254, -0.027461862191557884, -0.005414269864559174, 0.0015321001410484314, -0.03159527853131294, 0.03672318533062935, -0.029249846935272217, 0.04893786832690239, 0.020827297121286392, 0.018004167824983597, -0.04648810625076294, 0.04989476129412651, 0.024341527372598648, -0.013592492789030075, 0.018051091581583023, 0.010257720947265625, -0.013000108301639557, 0.020691100507974625, -0.023260319605469704, 0.007450234144926071, 0.012587439268827438, 0.00560532882809639, -0.011795032769441605, 0.028631631284952164, -0.04108874872326851, 0.01108849048614502, -0.022327160462737083, 0.0013176575303077698, 0.015574846416711807, 0.0490109957754612, 0.028510067611932755, -0.036038875579833984, -0.04419280216097832, -0.0379144549369812, 0.025037970393896103, -0.03398028761148453, 0.01290685310959816, -0.03882954269647598, -0.03962809965014458, 0.007046699523925781, 0.04483944550156593, -0.02403123490512371, 0.026020262390375137, 0.011992178857326508, -0.033248141407966614, -0.013718951493501663, 0.043630506843328476, -0.035476554185152054, 0.0011217594146728516, -0.0012787692248821259], [-0.02733457088470459, 0.04218954220414162, -0.025776565074920654, -0.04907429218292236, -0.043390631675720215, -0.01887362077832222, -0.04023010656237602, -0.03250328451395035, -0.04395804554224014, -0.013139139860868454, 0.003629624843597412, -0.04602804407477379, -0.039759792387485504, -0.03241410106420517, 0.01575995609164238, 0.01761564239859581, -0.005213569849729538, -0.027780521661043167, 0.013455498963594437, 0.002063751220703125, -0.026348471641540527, 0.04320763424038887, -0.03402506187558174, 0.008227132260799408, -0.04750950261950493, -0.011053144931793213, 0.03364647552371025, 0.03695026412606239, -0.033283792436122894, -0.034720875322818756, -0.031962014734745026, 0.02441081777215004, 0.0005265474319458008, -0.04631413146853447, -0.03190755844116211, 0.025346342474222183, -0.02044830285012722, -0.009084273129701614, -0.007407642900943756, -0.018610991537570953, -0.005402255803346634, 0.03379979357123375, 0.03267354890704155, 0.034479763358831406, -0.02044077031314373, 0.04233736917376518, -0.0473763607442379, 0.022960174828767776, 0.0013616904616355896, 0.004817701876163483, 0.03766048327088356, -0.04761316999793053, 0.011577140539884567, -0.04848295450210571, 0.03807559236884117, -0.043258655816316605, 0.02934643253684044, -0.03541473299264908, 0.021327916532754898, -0.0064928531646728516, -0.015924416482448578, 0.02945942059159279, 0.012991201132535934, -0.02045886591076851], [-0.020558929070830345, 0.009706031531095505, 0.0006837844848632812, -0.005111478269100189, 0.0031894072890281677, -0.004756521433591843, 0.007301580160856247, 0.03248195722699165, -0.005077280104160309, -0.041941843926906586, 0.03846534714102745, -0.025956762954592705, 0.033937763422727585, 0.04752654954791069, -0.021009469404816628, -0.013845302164554596, 0.025663841515779495, 0.0388207770884037, 0.01142944023013115, -0.03028813563287258, 0.03439532592892647, 0.032325293868780136, -0.04650917276740074, 0.025623749941587448, 0.027484368532896042, -0.04291189834475517, 0.01971454545855522, -0.04404180124402046, 0.035183098167181015, 0.02826373651623726, -0.03920600563287735, -0.042045094072818756, -0.04345564916729927, 0.04083195701241493, -0.03961857408285141, 0.02256416156888008, -0.04674006626009941, 0.046571020036935806, 0.017424847930669785, 0.03946887329220772, -0.03927614539861679, 0.01652388647198677, -0.028287841007113457, 0.019339967519044876, -0.0021516792476177216, 0.019560758024454117, 0.03107830509543419, 0.031214643269777298, -0.037956394255161285, 0.004833448678255081, -0.048142075538635254, 0.00927124172449112, 0.043275799602270126, 0.02224813774228096, 0.046901728957891464, -0.004955612123012543, -0.04790247604250908, 0.003550957888364792, 0.04987884685397148, -0.039004553109407425, -0.009685982018709183, 0.030981574207544327, -0.005817186087369919, 0.0012499578297138214], [0.0007224902510643005, -0.006340634077787399, -0.01950434409081936, -0.027969002723693848, -0.032032690942287445, 0.04128160700201988, -0.01005859300494194, -0.018977606669068336, -0.0484498031437397, 0.043469492346048355, 0.001181386411190033, 0.01819838210940361, 0.017816174775362015, 0.02353796735405922, 0.02682354673743248, 0.009466566145420074, -0.009110666811466217, -0.025494469329714775, -0.025577425956726074, 0.04187551513314247, -0.022941386327147484, 0.0066994912922382355, 0.03275502845644951, 0.0015179738402366638, -0.04858383163809776, -0.04196739196777344, -0.03344990313053131, -0.04537501558661461, -0.02157428301870823, 0.024820420891046524, -0.004429720342159271, 0.03839163854718208, 0.03201580420136452, 0.019303109496831894, -0.03296482563018799, 0.029211167246103287, 0.005217481404542923, -0.016048848628997803, 0.0074342601001262665, 0.028667990118265152, -0.02068459987640381, -0.026825476437807083, 0.010910462588071823, -0.03938869386911392, 0.043156277388334274, -0.045740436762571335, 0.02508929744362831, -0.04569622501730919, -0.012225080281496048, 0.0014735572040081024, -0.04239090904593468, -0.028924429789185524, -0.010386206209659576, 0.024701479822397232, -0.021383285522460938, -0.03748418018221855, 0.02360207960009575, -0.03863980621099472, -0.037052132189273834, -0.008779346942901611, -0.003911089152097702, 0.010862566530704498, -0.042318928986787796, -0.021371936425566673], [-0.0490565188229084, -0.043475497514009476, 0.0446736104786396, -0.0017910599708557129, 0.016662288457155228, 0.021816466003656387, -0.04716193675994873, 0.03440066799521446, 0.015910957008600235, 0.004550181329250336, -0.017952419817447662, 0.011423636227846146, 0.0035410746932029724, 0.038362767547369, -0.021379446610808372, -0.0417623408138752, 0.04129277542233467, -0.010835718363523483, -0.0007002130150794983, 0.040218476206064224, 0.040987882763147354, 0.002573728561401367, -0.007453657686710358, -0.005201257765293121, 0.005028892308473587, 0.009768426418304443, 0.019167307764291763, -0.022754324600100517, -0.04315021261572838, 0.04997158423066139, -0.03213143348693848, -0.03375593572854996, 0.02679051086306572, -0.04871658235788345, 0.04080944135785103, 0.006692744791507721, -0.026662027463316917, -0.030470335856080055, 0.026963915675878525, 0.040292177349328995, -0.036701370030641556, 0.011182330548763275, 0.009371675550937653, -0.03287311643362045, 0.016168247908353806, -0.018255770206451416, -0.007011283189058304, -0.034562848508358, 0.02488185092806816, 0.020070184022188187, -0.002589978277683258, -0.027264250442385674, 0.02075176313519478, 0.022938106209039688, 0.0247146375477314, 0.022424351423978806, -0.037474680691957474, 0.032960180193185806, -0.011070776730775833, -0.023412181064486504, 0.032435569912195206, -0.008674036711454391, -0.028904331848025322, 0.014385487884283066], [-0.019564438611268997, -0.04543362930417061, -0.014274559915065765, 0.009807061403989792, 0.007967829704284668, -0.02977454662322998, 0.030932318419218063, 0.04046515002846718, -0.03367283195257187, 0.03915837034583092, -0.03054267168045044, 0.04822368547320366, -0.02017652988433838, -0.012329615652561188, -0.010802902281284332, 0.01285567507147789, 0.047489289194345474, -0.03327976539731026, -4.0125101804733276e-05, 0.019486237317323685, 0.04983390495181084, -0.006225265562534332, 0.019335497170686722, 0.0010200515389442444, -0.04674199968576431, 0.01617060974240303, -0.0495547316968441, 0.031167935580015182, 0.02439439669251442, -0.02016524039208889, 0.034966494888067245, -0.03813128545880318, 0.017632726579904556, -0.006133221089839935, 0.027696017175912857, -0.03375152498483658, 0.03708392754197121, 0.04530227556824684, 0.04740413650870323, -0.0319502130150795, -0.015231836587190628, -0.044972170144319534, 0.021933387964963913, 0.02606780454516411, 0.013583067804574966, -0.038572441786527634, -0.022001659497618675, 0.024510156363248825, -0.04998410865664482, 0.049754548817873, 1.6652047634124756e-05, -0.0403035506606102, 0.0037318579852581024, 0.03399224206805229, 0.0490819476544857, -0.03500760719180107, -0.043745316565036774, 0.016574036329984665, 0.025845084339380264, 0.0027175545692443848, 0.04513413831591606, -0.0252220518887043, 0.00048617273569107056, 0.009554244577884674], [-0.026719391345977783, 0.03527383878827095, 0.003202427178621292, 0.028680216521024704, -0.045198965817689896, 0.011936523020267487, 0.015206221491098404, -0.037288762629032135, 0.007387340068817139, -0.04501694440841675, -0.012327421456575394, -0.003298722207546234, -0.019089533016085625, -0.021508408710360527, -0.04568382725119591, 0.03169297054409981, -0.040312670171260834, 0.01134411245584488, -0.042652346193790436, -0.045756615698337555, -0.009637951850891113, 0.03211622312664986, -0.021292686462402344, 0.04069418087601662, 0.042144302278757095, -0.03211945295333862, -0.015108980238437653, 0.03970075771212578, -0.003144502639770508, 0.016031626611948013, 0.021924402564764023, -0.039710283279418945, -0.04466508701443672, 0.019728507846593857, -0.0051316507160663605, 0.0005233176052570343, -0.0025922656059265137, -0.004116058349609375, 0.034252140671014786, -0.020360147580504417, 0.017705444246530533, 0.02542142942547798, -0.012012980878353119, 0.0003503449261188507, 0.04445774480700493, 0.02119145169854164, 0.03484896197915077, 0.02437485381960869, -0.004927016794681549, -0.02230294980108738, 0.02817554399371147, -0.009303055703639984, 0.00971820205450058, 0.013104144483804703, 0.03707091882824898, -0.02375342883169651, -0.02834399975836277, 0.04514678940176964, -0.027448559179902077, 0.01068943738937378, -0.021459056064486504, 0.02877836301922798, 0.03381372615695, 0.04254055395722389], [-0.003337811678647995, 0.03600038215517998, 0.01752198114991188, 0.03646223619580269, -0.008076798170804977, 0.031313780695199966, -0.012863218784332275, 0.009526155889034271, 0.005317699164152145, 0.011990986764431, 0.01483180746436119, 0.03903719410300255, -0.005166221410036087, 0.00859224796295166, -0.025805044919252396, -0.007120739668607712, -0.028598619624972343, -0.010999809950590134, -0.0017103180289268494, -0.015141487121582031, 0.03770441934466362, 0.04694254323840141, 0.012996602803468704, -0.03204268217086792, 0.003129206597805023, -0.03356821835041046, 0.038455355912446976, 0.02856164053082466, 0.03771461173892021, 0.00018220022320747375, 0.018901918083429337, -0.025127530097961426, -0.03406798839569092, -0.006299115717411041, -0.0028034672141075134, -0.04660041257739067, 0.011080048978328705, 0.019300255924463272, -0.025420987978577614, 0.012525264173746109, 0.020859982818365097, 0.024295959621667862, -0.036690451204776764, -0.01382584497332573, 0.005105484277009964, 0.010782815515995026, 0.046360138803720474, -0.037546493113040924, -0.046831704676151276, 0.02708454057574272, 0.006901703774929047, -0.005579423159360886, -0.03530373424291611, -0.01535036414861679, 0.03510803356766701, -0.037107039242982864, -0.00047354772686958313, 0.005294464528560638, -0.04231834411621094, 0.028254900127649307, 0.02747151628136635, -0.031446635723114014, -0.04257631301879883, 0.010047663003206253], [0.04434693232178688, -0.03640935570001602, 0.01705198362469673, 0.0010921135544776917, 0.01761821284890175, -0.013074349611997604, 0.0343022383749485, 0.014543186873197556, -0.02691093645989895, 0.01727992668747902, 0.0090186707675457, 0.007607925683259964, 0.035250093787908554, -0.025799060240387917, 0.0024961456656455994, -0.020245134830474854, -0.04218797758221626, 0.04173654690384865, -0.018871618434786797, -0.0030607469379901886, -0.022574543952941895, -0.024340903386473656, -0.03413771465420723, 0.031676363199949265, 0.02356768026947975, 0.04022691026329994, -0.02168222703039646, 0.012486159801483154, 0.013360988348722458, 0.034298721700906754, 0.04534796252846718, -0.028057361021637917, -0.016925491392612457, 0.012295283377170563, -0.001667071133852005, -0.0014031901955604553, 0.025622975081205368, -0.013998784124851227, -0.01655184105038643, 0.01658642664551735, -0.04404407739639282, 0.03682383522391319, 0.03544921800494194, -0.04538467153906822, -0.01933598518371582, -0.03639385849237442, 0.028489697724580765, -0.027065325528383255, -0.010063327848911285, 0.047980692237615585, -0.04203624650835991, 0.03979143872857094, -0.024632800370454788, 0.027528073638677597, 0.03441439941525459, 0.03820851817727089, 0.04743384197354317, -0.000384010374546051, -0.046209659427404404, 0.04174257442355156, -0.01174778863787651, -0.0016447529196739197, 0.035656992346048355, -0.009273193776607513], [-0.042795538902282715, 0.003646980971097946, 0.016779374331235886, -0.02740420214831829, -0.04513854905962944, -0.022160863503813744, 0.019106749445199966, -0.024276304990053177, -0.03985100984573364, 0.025146614760160446, 0.046542491763830185, 0.02282721921801567, -0.02677445486187935, -0.01089571788907051, -0.005518663674592972, 0.014325965195894241, 0.014276120811700821, -0.0361371748149395, -0.04885399341583252, -0.028849352151155472, -0.02747868373990059, 0.031631436198949814, 0.039840880781412125, -0.03295232355594635, 0.03838733211159706, 0.0408199317753315, -0.044316232204437256, -0.023760605603456497, -0.01750091463327408, 0.007200933992862701, 0.031346309930086136, 0.0018306747078895569, 0.0005123130977153778, 0.017442237585783005, 0.03475679084658623, -0.049480535089969635, -0.03625981882214546, 0.0021783486008644104, -0.04111236333847046, -0.04985692724585533, -0.035756539553403854, 0.02756083384156227, -0.02217789925634861, -0.018888724967837334, 0.0445827953517437, 0.04035872593522072, -0.014232706278562546, 0.01971231773495674, -0.04507216438651085, 0.03911605849862099, -0.04431728273630142, -0.047266390174627304, -0.013251028954982758, 0.0018920674920082092, 0.004988551139831543, 0.01561124250292778, -0.04672238975763321, 0.02272031083703041, 0.04324570670723915, -0.046650659292936325, -0.03387327492237091, -0.004616916179656982, -0.005186699330806732, -0.0005840770900249481], [0.04554319754242897, -0.005876220762729645, 0.004520881921052933, -0.017690815031528473, -0.04080779477953911, -0.014242388308048248, 0.04738961532711983, -0.0004534013569355011, 0.005151689052581787, 0.03723975643515587, 0.004779219627380371, 0.003911949694156647, -0.019165372475981712, -0.016798723489046097, -0.023058855906128883, -0.01709064096212387, 0.008535671979188919, -0.010172892361879349, 0.043902765959501266, -0.04182006046175957, 0.01753382757306099, -0.025324761867523193, 0.026004504412412643, -0.01936711184680462, 0.006236683577299118, 0.025449302047491074, 0.020139839500188828, 0.041003260761499405, 0.04828814044594765, 0.03687019273638725, 0.017494473606348038, -0.02671372890472412, -0.03216182067990303, 0.03253806009888649, 0.04431316629052162, 0.0069992318749427795, 0.017795074731111526, 0.010373760014772415, -0.008424568921327591, 0.01840778812766075, 0.03343108668923378, -0.04825722053647041, 0.030748140066862106, -0.008376576006412506, 0.00927950069308281, 0.04967475309967995, -0.04449659585952759, -0.017033804208040237, -0.041782356798648834, -0.011194251477718353, 0.010339833796024323, 0.0026009902358055115, -0.020207775756716728, 0.009456433355808258, 0.009323514997959137, 0.04940655454993248, -0.047498274594545364, 0.009930718690156937, 0.042196307331323624, 0.004720605909824371, -0.017300806939601898, 0.01742270216345787, -0.01714719459414482, 0.00959550216794014], [0.0328715555369854, 0.009449280798435211, 0.014817211776971817, -0.039621032774448395, 0.032812248915433884, 0.04816845431923866, -0.046773623675107956, 0.032451894134283066, -0.03521275520324707, 0.03499516472220421, 0.02400975301861763, -0.04099750518798828, 0.0391777865588665, 0.048729073256254196, -0.04638124629855156, -0.03564155101776123, -0.04106621816754341, -0.04045593738555908, -0.010738611221313477, 0.0002575404942035675, 0.007010899484157562, -0.022848499938845634, -0.04184345155954361, -0.00437164306640625, -0.023884523659944534, 0.013251256197690964, -0.02353982999920845, -0.02143096923828125, -0.002485610544681549, 0.022282864898443222, -0.026239562779664993, -0.009510062634944916, -0.042332973331213, -0.0385395884513855, -0.028458869084715843, -0.049232494086027145, 0.010636996477842331, -0.0011343136429786682, 0.011678196489810944, 0.04802531376481056, -0.0492556206882, -0.034720052033662796, -0.029332458972930908, -0.00436624139547348, 0.04263356700539589, 0.005598388612270355, 0.024630729109048843, 0.037074197083711624, -0.007159911096096039, 0.02931859716773033, 0.03512120619416237, 0.04360109940171242, 0.024823401123285294, 0.029377903789281845, -0.01576458290219307, 0.003723789006471634, -0.02824016846716404, 0.02995917573571205, -0.02796933613717556, -0.03938790410757065, -0.014234386384487152, -0.04460057243704796, -0.04667077213525772, -0.016731154173612595], [-0.03516441583633423, -0.01543128490447998, 0.015672456473112106, -0.019419431686401367, 0.03836517408490181, 0.006085406988859177, 0.005025077611207962, -0.014532219618558884, 0.014571871608495712, -0.04683199152350426, 0.031787943094968796, 0.0010881312191486359, -0.041631005704402924, -0.02280670404434204, 0.013029370456933975, -0.0072359442710876465, -0.0366971381008625, 0.02181624248623848, -0.03082604520022869, 0.040337931364774704, -0.003996539860963821, 0.04130730405449867, -0.040029026567935944, -0.009450197219848633, 0.01335456594824791, -0.03933519124984741, 0.015025261789560318, 0.04600993171334267, -0.04181525856256485, -0.02921478822827339, -0.03125276416540146, 0.036647964268922806, -0.01649029180407524, 0.03728921338915825, -7.592141628265381e-06, -0.0357181653380394, -0.005434058606624603, 0.03742518648505211, -0.03553994745016098, -0.0263917688280344, 0.031219366937875748, 0.040361132472753525, -0.039865005761384964, -0.0007195472717285156, -0.00214318186044693, -0.021407878026366234, 0.035403165966272354, 0.01596958562731743, -0.0022258758544921875, 0.04842061176896095, 0.04517838731408119, -0.032464563846588135, -0.03203888237476349, -0.03983098268508911, -0.031630419194698334, -0.01479952409863472, 0.04646341875195503, 0.02880009636282921, 0.03579384461045265, 0.0004835948348045349, 0.026287589222192764, 0.0007496699690818787, -0.039517927914857864, -0.0052735209465026855], [-0.024679316207766533, 0.03234625235199928, -0.010234106332063675, -0.027322042733430862, -0.0013712532818317413, -0.005014576017856598, 0.04224980250000954, -0.04075758531689644, -0.04209943860769272, -0.018509067595005035, 0.040616992861032486, 0.02323545143008232, 0.029104385524988174, 0.03731623664498329, -0.045017875730991364, 0.015287388116121292, -0.004541456699371338, -2.8289854526519775e-05, 0.04354056343436241, 0.00622192770242691, 0.0266321562230587, 0.005817484110593796, 0.04668926075100899, 0.030997876077890396, 0.024785254150629044, 0.006684541702270508, -0.01570139080286026, 0.01937992498278618, 0.009328722953796387, 0.03691306337714195, -0.0418073907494545, -0.012889064848423004, 0.015078272670507431, 0.01727888360619545, -0.025639308616518974, -0.024782871827483177, -0.0202132947742939, -0.016484905034303665, -0.03821510076522827, -0.0022395849227905273, -0.02522057294845581, -0.036697305738925934, 0.016809169203042984, -0.02012810669839382, 0.046020518988370895, -0.02480267360806465, -0.03720517084002495, 0.031564127653837204, -0.01044144481420517, 0.027784381061792374, -0.012193750590085983, -0.0033660903573036194, 0.022718552500009537, 0.008664965629577637, 0.034397948533296585, 0.004378557205200195, 0.0028876662254333496, -0.02564864233136177, 0.03884186968207359, -0.017823826521635056, -0.016920041292905807, 0.03104424849152565, -0.00948946550488472, -0.011620651930570602], [-0.012109242379665375, 0.032159898430109024, 0.045189086347818375, -0.0017965324223041534, 0.013538960367441177, -0.0319317951798439, -0.023142242804169655, 0.011837173253297806, -0.012697089463472366, -0.021609533578157425, 0.008337389677762985, 0.03235002979636192, 0.035205673426389694, -0.010354243218898773, 0.045842494815588, -0.03360407426953316, -0.004540730267763138, 0.02017209306359291, -0.017788518220186234, -0.04772299528121948, 0.037956926971673965, 0.024383988231420517, -0.014496125280857086, -0.00512319803237915, 0.010850630700588226, -0.029625071212649345, 0.02525264397263527, 0.0307638980448246, 0.02877521887421608, -0.04097546264529228, 0.009589623659849167, -0.04835709556937218, -0.03145799785852432, -0.002558112144470215, -0.003835715353488922, -0.017129063606262207, 0.02841055765748024, 0.005908798426389694, 0.025263849645853043, -0.040760744363069534, -0.022406626492738724, -0.04752260446548462, 0.02455129846930504, 0.04183847829699516, -0.010861434042453766, -0.027915334329009056, 0.012495886534452438, -0.04260833188891411, -0.010581683367490768, -0.0288566704839468, 0.03354592248797417, -0.04942014440894127, -0.019593000411987305, 0.02659536525607109, -0.019945645704865456, -0.04761246591806412, 0.03592381253838539, -0.03133627027273178, -0.04793647676706314, 0.047410476952791214, 0.041678499430418015, 0.042939890176057816, -0.012550722807645798, -0.011194050312042236], [0.042547691613435745, -0.037632204592227936, -0.03463141992688179, -0.0038862600922584534, -0.018524013459682465, -0.008547652512788773, -0.03396552801132202, 0.020110074430704117, -0.04390477016568184, -0.0008629076182842255, -0.009484577924013138, 0.04453421011567116, -0.0036503449082374573, -0.005565691739320755, 0.0007990486919879913, -0.021129334345459938, 0.018717553466558456, -0.025439513847231865, -0.028315020725131035, 0.0007831454277038574, -0.016108285635709763, 0.029811810702085495, 0.02479458972811699, 0.008037973195314407, -0.030758023262023926, -0.035810958594083786, 0.012523163110017776, 0.025634314864873886, 0.0011316761374473572, 0.013172123581171036, 0.029563788324594498, -0.004431772977113724, 0.0023343563079833984, -0.04593132808804512, -0.006106950342655182, 0.04571670666337013, -0.014582384377717972, -0.043180931359529495, 0.0018851645290851593, 0.009525202214717865, 0.0058486685156822205, -0.03687930107116699, 0.0064167603850364685, -0.043619073927402496, 0.00014243274927139282, -0.01523507758975029, -0.026905883103609085, -0.010434724390506744, 0.00978175550699234, -0.027960658073425293, 0.013653207570314407, 0.002205967903137207, 0.03836772218346596, 0.00276869535446167, 0.0029171332716941833, 0.035066936165094376, 0.036583054810762405, 0.03674241527915001, 0.03407176956534386, 0.04206554964184761, 0.011978723108768463, 0.009321153163909912, -0.013276219367980957, 0.032707955688238144], [0.011073611676692963, 0.03744783625006676, 0.01714729145169258, 0.04136526957154274, 0.04711360111832619, 0.006304454058408737, 0.04027482494711876, 0.02207651361823082, 0.00460275262594223, -0.016429759562015533, -0.009168099611997604, 0.03403729572892189, -0.049968816339969635, 0.0011803880333900452, -0.03108503855764866, -0.017642486840486526, -0.021897030994296074, -0.03101245127618313, 0.03292664512991905, -0.046684086322784424, -0.016256511211395264, -0.0488218329846859, -0.02760089747607708, 0.04252500459551811, 0.014542881399393082, 0.02104666456580162, 0.007072627544403076, 0.04121004417538643, 0.03469489887356758, -0.016341209411621094, -0.03726043552160263, -0.01976003684103489, -0.04033728688955307, -0.017097700387239456, -0.01389848068356514, 0.00514540821313858, 0.0010818243026733398, -0.0012937411665916443, -0.02926485612988472, -0.005653060972690582, -0.006634164601564407, 0.008499275892972946, 0.020270708948373795, -0.02307986095547676, -0.020462727174162865, -0.041294097900390625, -0.022222865372896194, 0.049025844782590866, -0.013205371797084808, -0.049906231462955475, 0.005908239632844925, -0.023154759779572487, -0.04588587209582329, 0.02516491338610649, -0.03362997621297836, -0.016990363597869873, 0.03787717595696449, -0.021129464730620384, -0.04098238795995712, -0.0373401865363121, 0.03606555238366127, 0.02332555130124092, -0.04590705782175064, -0.03541368246078491], [-0.018680214881896973, -0.03720749542117119, 0.031694088131189346, -0.041686393320560455, 0.04724550619721413, 0.046093810349702835, 0.03890775516629219, 0.0324096716940403, 0.047222938388586044, 0.022641409188508987, -0.005725454539060593, 0.016479063779115677, 0.016284633427858353, 0.030310604721307755, 0.043106142431497574, -0.039285145699977875, 0.03235436603426933, 0.011075925081968307, -0.027694690972566605, -0.0021247491240501404, 0.028499748557806015, 0.018169309943914413, 0.022751692682504654, 0.004424441605806351, 0.0140615813434124, -0.02488098107278347, 0.015141654759645462, -0.044341396540403366, -0.018363583832979202, 0.007846333086490631, -0.049220528453588486, -0.025805998593568802, 0.03565576300024986, -0.03824209049344063, 0.00578916072845459, -0.04912332445383072, 0.024700235575437546, -0.03229342773556709, 0.03477514907717705, -0.016136564314365387, 0.017319265753030777, -0.029111647978425026, 0.00693352147936821, -0.03434785455465317, -0.0342523455619812, -0.043152716010808945, -0.00018273666501045227, 0.016034040600061417, -0.02757558785378933, -0.03187626600265503, 0.005166817456483841, -0.046426594257354736, -0.01030036062002182, -0.02944563701748848, -0.006999708712100983, -0.039204191416502, -0.0418848879635334, -0.028507018461823463, -0.0212671160697937, 0.02697119489312172, -0.0041329748928546906, -0.04366866499185562, 0.02593233808875084, -0.04947958141565323], [-0.012266505509614944, -0.01885155402123928, -0.012175999581813812, -0.016874156892299652, -0.03208376467227936, -0.040860213339328766, -0.017298340797424316, -0.015682518482208252, 0.03144646808505058, -0.02765876054763794, 0.01719958707690239, 0.011974431574344635, 0.036737654358148575, 0.035900238901376724, -0.027828073129057884, -0.01277148723602295, -0.007841803133487701, -0.005686450749635696, 0.009805630892515182, -0.01573789119720459, 0.029078353196382523, -0.03854372352361679, 0.04715505614876747, 0.03146619722247124, -0.03765040636062622, -0.0003377199172973633, 0.02695683017373085, 0.04057225212454796, 0.019427623599767685, 0.04240255430340767, -0.030134474858641624, -0.028304828330874443, -0.0015826597809791565, 0.03247758373618126, 0.006912209093570709, -0.02078430727124214, 0.019469965249300003, 0.010499395430088043, -0.010811258107423782, -0.007746540009975433, 0.03538118675351143, -0.018363535404205322, 0.04641127958893776, -0.0089544877409935, 0.006896674633026123, -0.021520232781767845, -0.03567701578140259, 0.02622094377875328, -0.04519066959619522, 0.025830302387475967, -0.04382580518722534, -0.002855338156223297, -0.025829613208770752, -0.008385695517063141, 0.015087869018316269, -0.02525724284350872, -0.02189105749130249, 0.0017264485359191895, 0.027689609676599503, 0.006844721734523773, -0.009194038808345795, 0.004065264016389847, 0.010024011135101318, 0.019308459013700485], [-0.0018109679222106934, -0.04756186157464981, -0.01667548343539238, -0.028028463944792747, -0.04327310249209404, -0.02157689444720745, 0.04689014330506325, 0.004969906061887741, -0.044683802872896194, -0.001948188990354538, -0.0242728590965271, -0.02538996934890747, 0.012500811368227005, -0.04846137762069702, -0.005362309515476227, -0.00038756057620048523, -0.03200496733188629, 0.04281313344836235, -0.02281848154962063, 0.025760602205991745, 0.00017637014389038086, -0.011915456503629684, 0.01549438014626503, -0.0414574034512043, -0.03830137103796005, 0.02766421064734459, -0.0155792236328125, -0.045079078525304794, -0.036407601088285446, 0.037985268980264664, 0.025093745440244675, -0.018147528171539307, 0.03278886154294014, -0.02329890802502632, -0.02541375160217285, -0.026028824970126152, 0.04200097545981407, -0.00031157582998275757, -0.03611407428979874, 0.044833432883024216, -0.0065367333590984344, -0.029690802097320557, -0.0036866776645183563, 0.015846457332372665, 0.027013350278139114, 0.019215773791074753, -0.030039751902222633, 0.012989629060029984, -0.04421528801321983, -0.0007852092385292053, -0.011524640023708344, -0.049293387681245804, -0.006156574934720993, -0.023291243240237236, 0.00322888046503067, 0.038878295570611954, -0.04440493509173393, 0.036998141556978226, -0.04310666397213936, -0.008919548243284225, 0.006432376801967621, -0.034042492508888245, -0.011973083019256592, -0.016588352620601654], [0.017430733889341354, 0.0458250530064106, 0.002989400178194046, 0.018938925117254257, -0.01800912618637085, 0.02056490257382393, 0.03869303688406944, 0.020254064351320267, -0.010847140103578568, 0.011027108877897263, -0.04591212421655655, -0.009514473378658295, 0.022668492048978806, -0.032758451998233795, 0.023979339748620987, -0.027965879067778587, -0.03853834792971611, 0.04283012077212334, 0.026635732501745224, -0.027558565139770508, 0.03038417175412178, -0.003012336790561676, 0.022465791553258896, 0.013888690620660782, 0.02526560053229332, 0.030188169330358505, -0.008874405175447464, 0.03769350424408913, -0.00360875204205513, -0.034426819533109665, 0.0447070486843586, 0.04534042254090309, 0.009294189512729645, 0.03014088049530983, 0.0032049790024757385, -0.047203924506902695, -0.04822167381644249, -0.04520571231842041, 0.039806608110666275, -0.005238711833953857, 0.02494669333100319, 0.031378354877233505, -0.03003448247909546, -0.014212287962436676, -0.02730851247906685, 0.029908444732427597, 0.003813575953245163, 0.032558586448431015, -0.04846090078353882, 0.03070671483874321, 0.039059583097696304, -0.021360313519835472, 0.018623951822519302, 0.020305577665567398, 0.03711118921637535, 0.025039326399564743, -0.046475041657686234, -0.02925574779510498, -0.047038983553647995, -0.0435185432434082, -0.00481032207608223, 0.03596768155694008, -0.03610263019800186, -0.02861478365957737], [0.0023574605584144592, 0.009256910532712936, -0.04999948665499687, -0.04398059844970703, -0.024348223581910133, 0.047807250171899796, -0.006622254848480225, -0.0337616428732872, 0.015985097736120224, 0.013549555093050003, 0.037768807262182236, 0.04105125740170479, -0.021449102088809013, -0.01955702342092991, -0.014185130596160889, -0.005788981914520264, -0.0012710094451904297, 0.01389104500412941, -0.0048185475170612335, -0.008488357067108154, 0.017300356179475784, -0.04073714092373848, -0.010619521141052246, 0.0018150582909584045, 0.02819422259926796, -0.0243887547403574, 0.013015735894441605, -0.004494689404964447, 0.03287037834525108, -0.046545278280973434, 0.030509714037179947, -0.01048734039068222, 0.04028130695223808, -0.0001774318516254425, -0.014893092215061188, 0.013467561453580856, -0.03785828500986099, -0.03913501650094986, 0.043209318071603775, -0.03091338835656643, -0.03230391815304756, 0.027637865394353867, 0.019361723214387894, 0.03877650573849678, 0.04769733175635338, -0.031241178512573242, 0.029122736304998398, -0.026375889778137207, 0.0013622641563415527, -0.04010560363531113, -0.034507084637880325, -0.04241979122161865, -0.013454578816890717, -0.03427240997552872, -0.008316289633512497, 0.03348802402615547, -0.027449345216155052, -0.00907069444656372, -0.025858892127871513, -0.04204472154378891, -0.03856579214334488, -0.006393302232027054, 0.00883423164486885, 0.030895065516233444], [0.029259297996759415, 0.009885549545288086, -0.013304293155670166, -0.007868766784667969, 0.028167221695184708, 0.008638881146907806, -0.0177779421210289, 0.04361257329583168, 0.02102644369006157, -0.027676070109009743, 0.02571621909737587, 0.015926126390695572, 0.018308114260435104, -0.004046417772769928, -0.03319647163152695, -0.04606447368860245, -0.03220362961292267, 0.035875026136636734, 0.02328306809067726, -0.011729337275028229, -0.02988499402999878, 0.04009837284684181, -0.022144032642245293, 0.029484223574399948, 0.02076772227883339, -0.04430877044796944, -0.03818304464221001, -0.01946309767663479, -0.0297393798828125, -0.04650501161813736, -0.024612296372652054, -0.005428694188594818, -0.04167671129107475, 0.017874430865049362, -0.011109065264463425, -0.011341594159603119, 0.04418640211224556, -0.018185961991548538, 0.025334272533655167, 0.037208590656518936, -0.043490421026945114, -0.01000295951962471, 0.007546614855527878, -0.04162870720028877, -0.019721126183867455, 0.02429654821753502, 0.02275431528687477, -0.02917511574923992, 0.0348845012485981, 0.0317256934940815, 0.0350339449942112, -0.03911857679486275, -0.0014419928193092346, 0.03656848892569542, -0.03027242422103882, -0.049308646470308304, 0.019933883100748062, 0.03949625417590141, -0.04736144468188286, -0.008828114718198776, 0.025246988981962204, -0.04758205637335777, 0.04687106981873512, 0.038064826279878616], [-0.04125310108065605, 0.037801411002874374, 0.012353956699371338, 0.04476597532629967, -0.01814352348446846, -0.03496112674474716, -0.04889393970370293, -0.009216535836458206, -0.03478742763400078, -0.007277332246303558, -0.013872038573026657, 0.005889438092708588, -0.00707007572054863, 0.03917809948325157, -0.036769043654203415, 0.011734258383512497, -0.04605191946029663, -0.00408477708697319, 0.014712784439325333, 0.04546704515814781, 0.04572417959570885, -0.02374185435473919, -0.03735020011663437, -0.04251065477728844, 0.0058470964431762695, -0.0023898854851722717, -0.027593983337283134, -0.042688798159360886, 0.027034137398004532, 0.038587260991334915, 0.03836468234658241, 0.016449201852083206, -0.012643493711948395, 0.020385410636663437, -0.013330496847629547, -0.04998443275690079, 0.0196630097925663, 0.048764754086732864, 0.04357227310538292, -0.03357940912246704, -0.027730846777558327, -0.0475938580930233, 0.02357686683535576, -0.03571619838476181, 0.03159835562109947, 0.011934757232666016, -0.029256928712129593, 0.047329213470220566, 0.04664546623826027, 0.014620732516050339, -0.010823749005794525, 0.023803118616342545, -0.04712025076150894, 0.0012431517243385315, -0.010212264955043793, -0.002460479736328125, 0.01898573711514473, 0.02253064140677452, 0.027866113930940628, 0.039652612060308456, 0.011320233345031738, 0.006772853434085846, -0.012800466269254684, -0.025099873542785645], [-0.013403166085481644, 0.0008251778781414032, -0.024617373943328857, 0.014983844012022018, 0.01949559524655342, 0.01110231876373291, -0.049733828753232956, 0.01333591714501381, -0.025237834081053734, 0.03676862642168999, 0.0005171075463294983, 0.034086015075445175, 0.02301706001162529, 0.023748647421598434, 0.04117241129279137, 0.0053497664630413055, -0.04726950079202652, -0.014075208455324173, 0.02052457258105278, -0.042849909514188766, -0.03477257490158081, 0.0090927854180336, -0.014248155057430267, 0.03473688289523125, 0.03142063692212105, -0.04336632415652275, -0.024410927668213844, -0.003045476973056793, -0.029743338003754616, 0.04269062355160713, 0.021781075745821, -0.047127366065979004, 0.016067814081907272, 0.00415194034576416, -0.02256472222507, 0.04343617334961891, 0.046418968588113785, 0.03850121423602104, 0.01718628779053688, -0.04496273025870323, -0.044631507247686386, 0.04497668519616127, 0.019929777830839157, -0.04082226753234863, -0.03189365938305855, -0.025788212195038795, 0.042948056012392044, 0.0408533550798893, 0.029467549175024033, 0.024650070816278458, 0.024371113628149033, 0.04504073038697243, -0.01104797050356865, 0.04189738258719444, 0.049167606979608536, -0.03771352767944336, 0.014659155160188675, -0.044102516025304794, 0.029528561979532242, -0.034942757338285446, -0.0361056812107563, 0.01015378162264824, -0.019346415996551514, -0.022952331230044365], [-0.020208323374390602, -0.049682166427373886, -0.025472451001405716, 0.0447731651365757, 0.04397726431488991, -0.031213367357850075, -0.028962278738617897, 0.006281744688749313, -0.014526568353176117, -0.018653344362974167, 0.039972905069589615, -0.03602328151464462, -0.009975932538509369, -0.047175515443086624, -0.04321439191699028, -0.048560239374637604, -0.0017575137317180634, -0.006820224225521088, 0.04339506849646568, 0.02112020179629326, 0.04241612181067467, -0.010688863694667816, -0.016926847398281097, -0.03991406038403511, 0.03742743656039238, 0.04429221525788307, 0.04991134628653526, 0.000600278377532959, -0.011508144438266754, 0.006677139550447464, -0.01987762562930584, 0.03316345438361168, 0.025956299155950546, -0.04160958528518677, 0.027407553046941757, 0.033689502626657486, 0.04230060800909996, 0.0467396043241024, -0.002659060060977936, 0.024699199944734573, -0.023341095075011253, 0.015378963202238083, 0.011490155011415482, -0.04314021021127701, -0.012098480015993118, -0.04996452480554581, -0.01831207424402237, 0.02887401357293129, -0.005878519266843796, 0.018451597541570663, 0.03337391838431358, 0.029180411249399185, -0.03383822739124298, 0.023284386843442917, 0.03901202604174614, -0.0005897767841815948, 0.03867543861269951, -0.043335605412721634, -0.04616314172744751, 0.029419127851724625, 0.04476023092865944, -0.03691743686795235, 0.02105027809739113, -0.015439558774232864], [-0.036239542067050934, 0.006318330764770508, -0.013704337179660797, 0.03726866468787193, 0.039691995829343796, 0.024863187223672867, -0.03989098221063614, 0.04546350613236427, 0.03370744362473488, 0.04677904024720192, 0.03329683467745781, -0.04775940254330635, -0.0032683126628398895, -0.023015201091766357, 0.03841152414679527, 0.005250789225101471, 0.022262517362833023, -0.014706052839756012, 0.001082099974155426, 0.022477615624666214, 0.03976544365286827, 0.002707134932279587, -0.007014226168394089, -0.0184425488114357, -0.025945425033569336, -0.003689192235469818, -0.0027833208441734314, 0.03113548830151558, -0.03806787729263306, 0.01071997731924057, 0.02186700329184532, -0.010227464139461517, -0.0383584126830101, 0.042040277272462845, 0.022486571222543716, -0.04810410737991333, -0.04127582162618637, -0.018527258187532425, 0.023937199264764786, -0.020673274993896484, 0.040157709270715714, 0.01552433893084526, -0.01987743377685547, 0.030887234956026077, -0.025159109383821487, 0.009028267115354538, -0.026777077466249466, -0.021182382479310036, 0.022568058222532272, -0.04346717521548271, 0.02034798637032509, -0.026995182037353516, 0.020750228315591812, -0.04907270893454552, -0.004783153533935547, -0.014284789562225342, -0.04429810121655464, -0.018210995942354202, -0.034367941319942474, 0.023494277149438858, 0.01915593072772026, -0.020931219682097435, -0.026916682720184326, 0.04560822620987892], [-0.01661141961812973, 0.013649430125951767, 0.04062146320939064, -0.009758807718753815, -0.02788999117910862, -0.0155365951359272, 0.019091632217168808, -0.015235770493745804, 0.004761837422847748, -0.01678013801574707, 0.01836324855685234, -0.010460782796144485, 0.015018347650766373, -0.008192788809537888, 0.002650521695613861, -0.008272301405668259, -0.012016236782073975, 0.04385331645607948, 0.04594030603766441, 0.04914945736527443, -0.03150206804275513, 0.031217720359563828, 0.02163570001721382, 0.021750513464212418, -0.005660843104124069, 0.0006614550948143005, 0.00332028791308403, -0.04316446930170059, -0.01390836387872696, -0.02631361596286297, -0.012045741081237793, -0.043254878371953964, 0.0029620639979839325, 0.01154647022485733, -0.023735666647553444, -0.016500435769557953, -0.003216065466403961, -0.04700864478945732, -0.002339698374271393, -0.021246695891022682, -0.018466759473085403, 0.03255312517285347, -0.04698837921023369, 0.04794958606362343, 0.03956172242760658, -0.01051773875951767, -0.021030211821198463, -0.01075819879770279, -0.01939265802502632, -0.009960867464542389, 0.0035823695361614227, 0.008811615407466888, -0.039634428918361664, -0.041581593453884125, 0.030195865780115128, 0.0409478060901165, 0.04875587299466133, -0.015706144273281097, 0.022341106086969376, -0.02758805826306343, 0.037143830209970474, -0.044546760618686676, -0.044977106153964996, -0.043646883219480515], [0.02727602794766426, 0.047866176813840866, -0.0014690645039081573, -0.04024142026901245, 0.01947716251015663, -0.005421258509159088, 0.03487673029303551, -0.023569179698824883, 0.04786858335137367, 0.00041130930185317993, -0.013882458209991455, 0.03512388840317726, 0.048381198197603226, 0.03587918356060982, -0.028416765853762627, -0.03662079572677612, 0.01942947879433632, -0.010231517255306244, -0.012115538120269775, 0.026387784630060196, -0.04852811247110367, 